for(let i = 1; i <= 10; i++){
    console.log(i); // 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
}

// создать цикл, который будет выводить числа от 100 до 0 через 2
// 100, 97, 94, 91, 88, 85, 82, 79, 76, 73, 70, 67, 64, 61, 58, 55, 52, 49, 46, 43, 40, 37, 34, 31, 28, 25, 22, 19, 16, 13, 10, 7, 4, 1
let i = 100; // переменная i со значением 100
while (i >= 0) { // пока i больше или равно 0
    console.log(i); // выводим значение i в консоль
    i -= 3; // уменьшаем i на 3
} // конец цикла while

let a = 100; // переменная a со значением 100
for (let a = 100; a >= 0; a -= 3) { // цикл for от 100 до 0 с шагом -3
    console.log(a);
    if(a==1) { //если хоть добавить ноль в конце
        console.log(0);
    }
} // конец цикла for

// сделайте метод с параметром - от которого начинаем счет
// count(162) //  162, 159, 156, 153, 150, 147, 144, 141, 138, 135, 132, 129, 126, 123, 120, 117, 114, 111, 108, 105, 102, 99, 96, 93, 90, 87, 84, 81, 78, 75, 72, 69, 66, 63

// для примера более сложный пример
for (let i = 100, j = 5; i > j && j < 60; i--, j++) {
    console.log(i, j);
  }

// while
let q = 100;
while (q > 0) {
    console.log(q);
    q--;
}

const animals = ["panda", "wolf", "fox"];

// с помощью цикла while сделайте так, 
// чтобы в массиве все животные были написаны большими буквами
// ["panda", "wolf", "fox"] -> ["PANDA", "WOLF", "FOX"];

let w = 0;
while (w < animals.length) {
    animals[w] = animals[w].toUpperCase();
    w++;
}

console.log(animals);

// for ... of
for (let animal of animals) {
    console.log(animal);
}

